Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.1.46/samha1ab/svd/ATSAMHA1G14AB.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HMATRIX</name>
      <version>2.1.2</version>
      <description>HSB Matrix</description>
      <groupName>HMATRIXB</groupName>
      <prependToName>HMATRIXB_</prependToName>
      <baseAddress>0x41007000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>PRAS%s</name>
          <description>Priority A for Slave</description>
          <addressOffset>0x080</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>PRBS%s</name>
          <description>Priority B for Slave</description>
          <addressOffset>0x084</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SFR%s</name>
          <description>Special Function</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SFR</name>
              <description>Special Function Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LINCTRL</name>
      <version>1.0.0</version>
      <description>LIN control module</description>
      <groupName>LINCTRL</groupName>
      <prependToName>LINCTRL_</prependToName>
      <baseAddress>0x42005800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x08</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>control register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WOCFG</name>
              <description>wkout observation select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MTB</name>
      <version>1.0.0</version>
      <description>Cortex-M0+ Micro-Trace Buffer</description>
      <groupName>MTB</groupName>
      <prependToName>MTB_</prependToName>
      <baseAddress>0x41006000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>POSITION</name>
          <description>MTB Position</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WRAP</name>
              <description>Pointer Value Wraps</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POINTER</name>
              <description>Trace Packet Location Pointer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MASTER</name>
          <description>MTB Master</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MASK</name>
              <description>Maximum Value of the Trace Buffer in SRAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TSTARTEN</name>
              <description>Trace Start Input Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TSTOPEN</name>
              <description>Trace Stop Input Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFRWPRIV</name>
              <description>Special Function Register Write Privilege</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMPRIV</name>
              <description>SRAM Privilege</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALTREQ</name>
              <description>Halt Request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EN</name>
              <description>Main Trace Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLOW</name>
          <description>MTB Flow</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AUTOSTOP</name>
              <description>Auto Stop Tracing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTOHALT</name>
              <description>Auto Halt Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WATERMARK</name>
              <description>Watermark value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BASE</name>
          <description>MTB Base</description>
          <addressOffset>0x00C</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>ITCTRL</name>
          <description>MTB Integration Mode Control</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>CLAIMSET</name>
          <description>MTB Claim Set</description>
          <addressOffset>0xFA0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <description>MTB Claim Clear</description>
          <addressOffset>0xFA4</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>LOCKACCESS</name>
          <description>MTB Lock Access</description>
          <addressOffset>0xFB0</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>LOCKSTATUS</name>
          <description>MTB Lock Status</description>
          <addressOffset>0xFB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>AUTHSTATUS</name>
          <description>MTB Authentication Status</description>
          <addressOffset>0xFB8</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>DEVARCH</name>
          <description>MTB Device Architecture</description>
          <addressOffset>0xFBC</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>DEVID</name>
          <description>MTB Device Configuration</description>
          <addressOffset>0xFC8</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>DEVTYPE</name>
          <description>MTB Device Type</description>
          <addressOffset>0xFCC</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>PID4</name>
          <description>CoreSight</description>
          <addressOffset>0xFD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>PID5</name>
          <description>CoreSight</description>
          <addressOffset>0xFD4</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>PID6</name>
          <description>CoreSight</description>
          <addressOffset>0xFD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>PID7</name>
          <description>CoreSight</description>
          <addressOffset>0xFDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>PID0</name>
          <description>CoreSight</description>
          <addressOffset>0xFE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>PID1</name>
          <description>CoreSight</description>
          <addressOffset>0xFE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>PID2</name>
          <description>CoreSight</description>
          <addressOffset>0xFE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>PID3</name>
          <description>CoreSight</description>
          <addressOffset>0xFEC</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>CID0</name>
          <description>CoreSight</description>
          <addressOffset>0xFF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>CID1</name>
          <description>CoreSight</description>
          <addressOffset>0xFF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>CID2</name>
          <description>CoreSight</description>
          <addressOffset>0xFF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>CID3</name>
          <description>CoreSight</description>
          <addressOffset>0xFFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
